MikroElektronika/mikrosdk_v2/targets/arm/mikroe/ai_generated/stm32/include/tim/hal_ll_tim_pin_map/implementations/doc_ds_87/hal_ll_tim_pin_map.h
    {PE5, TIM3_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_3)},
    #endif
    #ifdef TIM3_ETR_PB3_AF10
    // {PB3, TIM3_BASE_ADDRESS, 0, 10, hal_ll_tim_module_num(TIM_MODULE_3)},
    #endif
    #ifdef TIM3_ETR_PD2_AF2
    // {PD2, TIM3_BASE_ADDRESS, 0, 2, hal_ll_tim_module_num(TIM_MODULE_3)},
    #endif
    #ifdef TIM4_CH1_PA11_AF10
    {PA11, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 10, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH1_PB6_AF2
    {PB6, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH1_PD12_AF2
    {PD12, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH2_PA12_AF10
    {PA12, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 10, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH2_PB7_AF2
    {PB7, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH2_PD13_AF2
    {PD13, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH3_PA13_AF10
    {PA13, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 10, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH3_PB8_AF2
    {PB8, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH3_PD14_AF2
    {PD14, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH4_PB9_AF2
    {PB9, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH4_PD15_AF2
    {PD15, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH4_PF6_AF2
    {PF6, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_ETR_PA8_AF10
    // {PA8, TIM4_BASE_ADDRESS, 0, 10, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_ETR_PB3_AF2
    // {PB3, TIM4_BASE_ADDRESS, 0, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_ETR_PE0_AF2
    // {PE0, TIM4_BASE_ADDRESS, 0, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM5_CH1_PA0_AF2
    {PA0, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH1_PB2_AF2
    {PB2, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH1_PF6_AF6
    {PF6, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 6, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH2_PA1_AF2
    {PA1, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 2, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH2_PC12_AF1
    {PC12, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 1, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH2_PF7_AF6
    {PF7, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 6, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH3_PA2_AF2
    {PA2, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 2, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH3_PE8_AF1
    {PE8, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 1, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH3_PF8_AF6
    {PF8, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 6, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH4_PA3_AF2
    {PA3, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH4_PE9_AF1
    {PE9, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 1, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_CH4_PF9_AF6
    {PF9, TIM5_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 6, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_ETR_PB12_AF2
    // {PB12, TIM5_BASE_ADDRESS, 0, 2, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_ETR_PD11_AF1
    // {PD11, TIM5_BASE_ADDRESS, 0, 1, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM5_ETR_PF6_AF1
    // {PF6, TIM5_BASE_ADDRESS, 0, 1, hal_ll_tim_module_num(TIM_MODULE_5)},
    #endif
    #ifdef TIM8_BKIN2_PB6_AF10
    // {PB6, TIM8_BASE_ADDRESS, 0, 10, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_BKIN2_PC9_AF6
    // {PC9, TIM8_BASE_ADDRESS, 0, 6, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_BKIN2_PD1_AF6
    // {PD1, TIM8_BASE_ADDRESS, 0, 6, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_BKIN_PA0_AF9
    // {PA0, TIM8_BASE_ADDRESS, 0, 9, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_BKIN_PA10_AF11
    // {PA10, TIM8_BASE_ADDRESS, 0, 11, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_BKIN_PA6_AF4
    // {PA6, TIM8_BASE_ADDRESS, 0, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_BKIN_PB7_AF5
    // {PB7, TIM8_BASE_ADDRESS, 0, 5, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_BKIN_PD2_AF4
    // {PD2, TIM8_BASE_ADDRESS, 0, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH1N_PA7_AF4
    {PA7, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH1N_PB3_AF4
    {PB3, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH1N_PC10_AF4
    {PC10, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH1_PA15_AF2
    {PA15, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH1_PB6_AF5
    {PB6, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 5, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH1_PC6_AF4
    {PC6, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH2N_PB0_AF4
    {PB0, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH2N_PB4_AF4
    {PB4, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH2N_PC11_AF4
    {PC11, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH2_PA14_AF5
    {PA14, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 5, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH2_PB8_AF10
    {PB8, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 10, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH2_PC7_AF4
    {PC7, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH3N_PB1_AF4
    {PB1, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH3N_PB5_AF3
    {PB5, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3N, 3, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH3N_PC12_AF4
    {PC12, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3N, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH3_PB9_AF10
    {PB9, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 10, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH3_PC8_AF4
    {PC8, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH4N_PC13_AF6
    {PC13, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4N, 6, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH4N_PD0_AF6
    {PD0, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4N, 6, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH4_PC9_AF4
    {PC9, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_CH4_PD1_AF4
    {PD1, TIM8_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 4, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_ETR_PA0_AF10
    // {PA0, TIM8_BASE_ADDRESS, 0, 10, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    #ifdef TIM8_ETR_PB6_AF6
    // {PB6, TIM8_BASE_ADDRESS, 0, 6, hal_ll_tim_module_num(TIM_MODULE_8)},
    #endif
    { HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_CHANNEL_ERROR, HAL_LL_PIN_NC, HAL_LL_PIN_NC }
};

#ifdef __cplusplus
}
#endif

#endif // _HAL_LL_TIM_PIN_MAP_H_
// ------------------------------------------------------------------------- END
